/*用对分法求方程f(x)=x^2-6*x-1=0在区间[-10,10]上的实根*/
/*对分法的基本过程为首先取子区间[xi,xi+1]的中点；如果f(x)
与f(xi)同号，则令xi=x；否则令xi+1=x。然后重复这个过程，直到
满足条件为止。*/ 
#include<stdio.h>
#include<math.h> 
/*首先从区间断电x0=a出发，以h为步长，逐步往后进行扫描。*/
/*然后对于每一个被扫描的子区间[xi,xi+1]作如下处理。*/
/*若在子区间两个端点上的函数值f(xi)与f(xi+1)同号，则说明在该
子区间上没有实根，将扫描下一个子区间；*/
/*若在子区间两个端点上的函数值f(xi)与f(xi+1)异号，说明在该子
区间上至少有一个实根。此时就可以在该子区间采用对分法进一步搜索实根。*/ 
int main(){
	int flag;
	double a=-10.0,b=10.0,h=0.1,x1,y1,x2,y2,x,y;
	x1=a; y1=x1*x1-6*x1-1.0;
	x2=x1+h; y2=x2*x2-6*x2-1.0;
	/*外循环：从区间的左边开始扫描区间，循环的控制条件表示区间的端点x1
	小于区间[a,b]的右边值，为x1<b。循环的变化规律为扫描下一个区间，x1=x2；*/ 
	while(x1<=b){
		if(y1*y2>0.0){
			x1=x2;y1=y2;
			x2=x1+h;y2=x2*x2-6*x2-1.0;
		}
		else{
			flag=0;
			while(flag==0){
				x=(x1+x2)/2;
				if(fabs(x2-x1)<0.000001){
					printf("x=%11.7f\n",x);
					x1=x+0.5*h; y1=x1*x1-6*x1-1.0;
					x2=x1+h;	y2=x2*x2-6*x2-1.0;
					flag=1;
				}
				else{
					y=x*x-6*x-1.0;
					if(y1*y<0.0){
						x2=x; y2=y;
					}
					else{
						x1=x; y1=y;
					}
				}
			}
		}
	}
	return 0;
} 
